Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Setting Up a Development Environment for Apache Flink | 71
zh_cn: 设置Apache Flink开发环境 | 71

source: Setting Up a Development Environment for Apache Flink.
zh_cn: 设置Apache Flink开发环境

source: Setting a unique identifier for an operator
zh_cn: 为算子设置唯一标识

source: Setting the Parallelism
zh_cn: 设置并行度

source: Setting the maximum parallelism of operators
zh_cn: 设置算子的最大并行度

source: Setting the parallelism
zh_cn: 设置并发度

source: Setting the time characteristic to EventTime enables timestamp and watermark handling, and as a result, event-time operations.
zh_cn: 将时间特性设置为EventTime后就可以对时间戳和水印进行处理，从而实现事件时间相关操作。

source: Setting the time characteristic to event time
zh_cn: 将时间特性设为事件时间

source: Setting up a development environment for Apache Flink.
zh_cn: 设置Apache Flink开发环境

source: Shuts down the Flink cluster.
zh_cn: 关闭Flink集群。

source: Side outputs are a feature of process functions to emit multiple streams from a function with possibly different types.
zh_cn: 而处理函数提供的副输出功能允许从同一函数发出多条数据流，且它们的类型可以不同。

source: Similar to ReduceFunction, AggregateFunction is also incrementally applied to the elements that are applied to a window.
zh_cn: 和ReduceFunction类似，AggregateFunction也会以增量方式应用于窗口内的元素。

source: Similar to a CoFlatMapFunction, a CoProcessFunction offers a transformation method for each input, processElement1() and processElement2().
zh_cn: 和ComFlatMapFunction类似，CoProcessFunction也提供了一对作用在每个输入上的转换方法——processFunction1()和processFunction2()。

source: Similar to job mode, Flink’s Web UI is linked from the Application Overview of YARN’s Web UI.
zh_cn: 和作业模式类似，Flink的Web UI链接可以从YARN Web UI的Application Overview页面上找到。

source: Similar to other data processing systems, Flink looks at the URI scheme of a path to identify the filesystem the path refers to.
zh_cn: 和其他数据处理系统类似，Flink通过检查路径URI的协议（scheme）来识别目标文件系统。

source: Similar to the Kafka source connector, you can pass a Properties object to pro‐ vide custom options to the internal Kafka client.
zh_cn: 和Kafka数据源连接器类似，你可以利用Properties对象为内部Kafka客户端提供一些自定义选项。

source: Similar to the ProcessFunction, both methods are called with a Context object that
zh_cn: 它们和ProcessFunction中的方法类似，

source: Similar to watermarks, checkpoint barriers are broadcasted to all connected parallel tasks to ensure that each task receives a barrier from each of its input streams.
zh_cn: 和水位线类似，检查点分隔符总是以广播形式发送，从而可以确保每个任务能从它们的每个输入都收到一个分隔符。

source: Similar to watermarks, checkpoint barriers are injected by source operators into the regular stream of records and cannot overtake or be passed by other records.
zh_cn: 和水位线类似，这些检查点分隔符会通过数据源算子注入到常规的记录流中。相对其他记录，它们在流中的位置无法提前或延后。

source: Similarly, consider an operator that raises an alert when it detects a “high temperature” event followed by a “smoke” event within 10 minutes.
zh_cn: 类似地，假设还有一个算子，会在每次检测到"高温"事件且在随后10分钟内出现"烟雾"事件时报警。

source: Similarly, if a system’s capacity is small, events will be buffered and have to wait before they get processed.
zh_cn: 同样，如果系统性能不足，事件很容易堆积缓冲，必须等待一段时间才能处理。

source: Similarly, the Back Pressure tab displays back-pressure statistics per operator and sub‐ task.
zh_cn: 同样，Back Pressure选项卡内展示了每个算子和子任务的背压统计信息。

source: Simple value conversions, splitting of records, or filtering of records are examples of common basic functions.
zh_cn: 常见的基本转换函数有：简单的值转换，记录拆分或过滤等。

source: Since Apache Derby does not provide a built-in UPSERT statement, the example sink performs UPSERT writes by first trying to update a row and inserting a new row if no
zh_cn: Apache Derby没有内置UPSERT语句。为此，示例中的数据汇是通过尝试更新、并在对应键值的数据不存在时执行插入的方式模拟UPSERT操作。

source: Since Flink is a distributed system and runs processes on cluster or cloud environments, filesystems typically need to be globally accessible.
zh_cn: 作为一个分布式系统，Flink需要在集群或云端环境中运行进程。对应地，文件系统通常需要支持全局访问，

source: Since Flink is a distributed system, the JobManager and TaskManagers typically run as separate JVM processes on different machines.
zh_cn: Flink作为一个分布式系统，其JobManager和TaskManager一般会在不同机器上作为独立的JVM进程运行。

source: Since Flink is a distributed system, the local state needs to be protected against failures to avoid data loss in case of application or machine failure.
zh_cn: 由于采用的是分布式架构，Flink需要对本地状态予以保护，以避免因应用或机器故障导致数据丢失。

source: Since Flink is a distributed system, the local state needs to be protected against failures to avoid data loss in case of application or machine failures.
zh_cn: 而由于是分布式的，Flink需要保护本地状态，以防因应用或机器故障导致数据丢失。

source: Since Flink is implemented in Java and Scala, all components run on Java Virtual Machines (JVMs).
zh_cn: 由于Flink本身是用Java和Scala实现的，因此所有组件都基于Java虚拟机（JVM）运行。

source: Since Flink is implemented in Java and Scala, all components run on a Java Virtual Machine (JVM).
zh_cn: 由于Flink本身是用Java和Scala实现的，因此所有组件都运行在Java虚拟机（JVM）之上。

source: Since Flink’s type system generates serializers depending on the data type of a state, the serializers are likely to change when the data type of a state changes.
zh_cn: 由于Flink的类型系统需要根据状态的数据类型生成序列化器，所以当状态的数据类型发生改变时，序列化器也可能随之改变。

source: Since Kryo is a general-purpose serializer it is usually not very efficient.
zh_cn: 由于Kryo是一个通用序列化器，因此通常效率不高。

source: Since POJO fields do not have a natural order, they need to be treated differently.
zh_cn: 由于POJO的字段不存在顺序，它需要被区别对待。

source: Since RocksDB is an external component, it brings its own set of tuning parameters that can also be tweaked for your application.
zh_cn: 由于RocksDB是一个外部组件，你也可以根据自己的应用对它自身的一些参数进行调整。

source: Since StateBackend is a public interface, it is also possible to implement a custom state backend.
zh_cn: 由于StateBackend接口是公开的，所以你也可以实现自定义的状态后端。

source: Since a socket does not have built-in transactional support, transactional writes can only be done using Flink’s generic WAL sink.
zh_cn: 而同时它也没有提供内置的事务支持，所以事务性写只能通过Flink的通用WAL数据汇来完成。

source: Since check‐ points are synchronized with function invocations, multiple state updates do not pro‐ vide any benefits but can cause additional serialization overhead when updating state several times in a single function call.
zh_cn: 由于检查点需要和函数调用同步，所以在单个函数内调用多次更新状态没有任何好处，反而会带来额外的序列化开销。

source: Since each parallel instance of the function must hold all rules in its operator state, the rules stream needs to be broadcasted to ensure each instance of the function receives all rules.
zh_cn: 由于函数的所有并行实例都需要在算子状态中保存全部规则，所以规则流需要以广播形式发送，以便每个实例都能收到全部规则。

source: Since elements are typically ingested in parallel, any operation that causes Flink to redistribute elements across parallel
zh_cn: 由于元素的读取过程通常都是并行的，所以一切引起Flink跨并行数据流分区进行重新分发的操作（例如改变并行度，keyBy()或显式重新分发）

source: Since files might not appear in order of their modification timestamps, they may be ignored by the filesys‐ tem source connector.
zh_cn: 由于文件可能不会按照它们修改时间的顺序出现，所以文件系统数据源连接器可能会忽略部分文件。

source: Since it has to iterate over all elements, it can only be used if no
zh_cn: 由于需要遍历所有元素，移除器只有在未指定增量聚合函数的时候才能使用。

source: Since it holds all state in memory and checkpoints are completely stored in the volatile and JVM-size
zh_cn: 由于它将所有状态保存在内存中，而且检查点全部位于易失且受JVM大小约束的JobManager堆存储内，

source: Since it is not possible to change the identifiers in a savepoint, you will have fewer options to update and evolve your application if
zh_cn: 保存点中的标识是无法修改的，因此你如果没有使用uid()手动分配算子标识，那么在更新或改进应用时就会受到一些限制。

source: Since its beginning, Flink has a very active and continuously growing community of users and contributors.
zh_cn: Flink自创建伊始就拥有一个活跃、不断发展的用户及贡献者群体。

source: Since its beginning, Flink has had a very active and continuously grow‐ ing community of users and contributors.
zh_cn: 它自创建伊始就拥有一个活跃、不断发展的用户及贡献者群体。

source: Since its memory is volatile, the state is lost in case of a JobManager failure.
zh_cn: 因为内存具有易失性，所以一旦JobManager出现故障，状态就会丢失。

source: Since most applications can only read files once they are finalized and streaming applications run for long periods of time, streaming sink connectors typically chunk their output into multiple files.
zh_cn: 由于大多数应用只有在文件最终确定后才会读取其内容，且流式应用通常会运行很长时间，所以流式数据汇连接器通常会将其输出写入多个文件。

source: Since multiple applications might work on the same data representation or share the same infrastructure, changing the schema of a table or scaling a database system requires careful planning and a lot of effort.
zh_cn: 一旦多个应用基于相同的数据表示或共享架构，那么更改Schema或对数据库系统进行扩缩容必将劳心费力。

source: Since our KeyedProcessFunction always updates the registered timer by deleting the current timer and registering a new one, only a single timer is registered per key.
zh_cn: 由于KeyedProcessFunction总会在注册新计时器之前将已有的计时器删除，所以每个键值在同一时间最多只会有一个注册的计时器。

source: Since release 1.0, the API has remained stable.
zh_cn: 自1.0发布版以来，它的API一直比较稳定。

source: Since savepoints are handled by the system similarly to regular checkpoints, operators also receive checkpoint completion notifications for completed savepoints and act on them.
zh_cn: 由于系统对于保存点的处理和常规的检查点类似，所以在保存点完成后算子同样会收到检查点完成完成通知并据其做出反应。

source: Since savepoints are such a powerful feature, many users periodically create save‐ points to be able to go back in time.
zh_cn: 保存点的功能如此强大，以至于很多用户都会周期性地创建保存点，从而可以及时"回到过去"。

source: Since state can become quite large and checkpointing requires writing the data over the network to a remote storage system, taking a checkpoint can easily take several seconds to minutes—much too long for latency-sensitive applications.
zh_cn: 由于状态可能会很大，而且生成检查点需要把这些数据通过网络写入远程存储系统，该过程可能持续数秒，甚至数分钟，这对于一些延迟敏感的应用而言时间过久。

source: Since state manage‐ ment is always custom and manually done in process functions, Flink does not pro‐ vide a built-in API to support late data.
zh_cn: 但由于处理函数内部的状态管理都是通过手工自定义来完成的，所以Flink没有在其中内置和迟到数据处理相关的API。

source: Since streaming appli‐
zh_cn: 但由于流式应用会一直执行且输入可能是无限的，因此在数据流处理中没有总执行时间的概念。

source: Since streaming applications are often required to run 24/7 with minimum downtime, many stream processors added features such as highly-available setups, tight integration with resource managers, such as YARN or Mesos, and the ability to dynamically scale streaming applications.
zh_cn: 由于流式应用经常需要近7*24小时不间断运行，很多流处理引擎会添加像高可用设置、与资源管理器（YARN、Mesos等）紧密集成、动态扩展流式应用等特性。

source: Since streaming appli‐ cations run continuously and the input is potentially unbounded, there is no notion of total execution time in data stream processing.
zh_cn: 但由于流式应用会持续执行且输入可能是无限的，所以在数据流处理中没有总执行时间的概念。

source: Since streaming operators process potentially unbounded data, caution should be taken to not allow internal state to grow indefinitely.
zh_cn: 由于流式算子处理的都是潜在无穷无尽的数据，因此必须小心避免内部状态无限增长。

source: Since task chaining improves the perfor‐ mance of most applications, it is enabled by default in Flink.
zh_cn: 由于任务链接可以提高大多数应用的性能，所以Flink默认会启动它。

source: Since tasks maintain their state locally, Flink has to ensure that this state is not lost and remains consistent in case of a failure.
zh_cn: 由于每个任务会把状态维护在本地，Flink要保证发生故障时状态不丢不错。

source: Since the aggregation is performed by the ReduceFunction, the ProcessWindowFunction only needs to append the window end timestamp to the incrementally computed result as shown in Example 6-14.
zh_cn: 由于聚合逻辑是由ReduceFunction执行的，ProcessWindowFunction只需要像示例6-14中那样，将窗口的结束时间戳加到递增计算结果后面即可。

source: Since the application’s source tasks were reset to an earlier input position, it processes data that it processed before the failure and data that accumulated while the applica‐ tion was down.
zh_cn: 由于应用的数据源任务被重置到一个较早的输入位置，所以它会处理故障发生前以及应用在停止工作期间积累的一些数据。

source: Since the checkpoint data is written twice, local recovery adds overhead to checkpointing.
zh_cn: 由于检查点数据需要被写入两次，所以本地恢复会为检查点生成带来一定额外开销。

source: Since the checkpoint was not committed yet, the sink will write all records again during recovery.
zh_cn: 由于此时检查点还未提交，下次恢复时会重写全部记录。

source: Since the events of both streams are mapped into the same windows, triggers and evictors behave exactly as in regular window operators.
zh_cn: 由于两条流中的事件会被映射到同一个窗口中，因此该过程中的触发器和移除器与常规窗口算子中的完全相同。

source: Since the handling of state directly affects the semantics of an operator, Flink cannot automati‐ cally clean up state and free storage.
zh_cn: 由于对状态的处理会直接影响算子语义，所以Flink无法通过自动清理状态来释放资源。

source: Since the length of a session is not defined beforehand but depends on the actual data, tumbling and sliding win‐ dows cannot be applied in this scenario.
zh_cn: 由于会话长度并非预先定义好，而是和实际数据有关，因此无论是滚动还是滑动窗口都无法用于该场景。

source: Since the log will be recovered, no records will be lost in the case of a failure.
zh_cn: 由于它在发生故障时可以恢复，所以不会导致数据丢失。

source: Since the maximum operator parallelism is four, the application requires at least four available processing slots to be executed.
zh_cn: 由于算子最大并行度是4，因此应用若要执行则至少需要4个处理槽。

source: Since the pur‐ pose of checkpoints is to ensure an application can be restarted in case of a failure, they are deleted when an application is explicitly canceled.4 However, consistent snap‐ shots of the state of an application can be used for many more things than just failure recovery.
zh_cn: 检查点的目的是保证应用可以在出现故障的时候顺利重启，因此当应用被手动停止后，检查点也会随之删除。4 但应用状态的一致性快照除了故障恢复外，还有很多其他用途。

source: Since the setup requires several steps, such as generating certificates, setting up TrustStores and KeyStores, and configuring cipher suites, we refer you to the official Flink documentation.
zh_cn: 由于启用步骤较为繁琐（需要生成证书，设置TrustStores和KeyStores，并配置密码套件等），我们建议你查阅Flink官方文档。

source: Since the sink buf‐ fers records in the state backend, the WAL sink can be used with any kind of sink system.
zh_cn: 由于该数据汇利用状态后端缓冲记录，所以它适用于任何一种数据汇系统。

source: Since the start and the end of a session window depend on the received elements, a window assigner cannot immediately assign all the elements to the correct window.
zh_cn: 由于会话窗口的开始和结束都取决于接收的元素，因此窗口分配器无法实时将所有元素分配到正确的窗口。

source: Since they depend on the ingestion order, count-based windows are not deter‐ ministic.
zh_cn: 由于要依赖元素的到达顺序，基于数量的窗口具有不确定性。

source: Since this state is never cleaned up, you should only apply a rolling aggregations operator on a stream with a bounded key domain.
zh_cn: 由于这些状态不会被自动清理，所以该算子只能用于键值域有限的流。

source: Since this state is never cleaned up, you should only apply a rolling reduce operator on a stream with a bounded key domain.
zh_cn: 由于这些状态不会被自动清理，所以该算子只能用于键值域有限的流。

source: Since watermarks should be data driven, a watermark generator (either integrated in a source function or in a timestamp assigner) will not emit new water‐ marks if it does not receive input records.
zh_cn: 由于水位线其实是数据驱动的，水位线生成器（无论是集成在数据源函数中的还是在时间戳分配器中的）若是收不到输入记录，就不会发出新的水位线。

source: Since we are using a simple nonmergable ValueState, the trigger is not mer‐ gable.
zh_cn: 由于我们使用了简单的不可合并状态ValueState，所以无法对触发器进行合并。

source: Since you are running a streaming application, it will continue to run until you cancel it.
zh_cn: 由于运行的是流式应用，因此它会一直运行下去，直到你手动取消。

source: Since you are running a streaming application, the application will continue to run until you cancel it.
zh_cn: 由于应用是流式的，它会一直运行下去，直到你手动取消。

source: Since you do not take into consideration late events and out-of-order events, a window simply needs to buffer up events and immediately trigger computation once the specified time length is reached.
zh_cn: 由于无需考虑迟到或乱序的事件，窗口只需简单地缓冲事件，然后在达到特定时间后立即触发窗口计算即可。

source: Since, multiple applications might work on the same data representation or share the same infrastructure, changing the schema of a table or scaling a database system requires careful planning and a lot of effort.
zh_cn: 一旦多个应用基于相同的数据表示或共享架构，那么更改表模式或对数据库系统扩容必将费心费力。

source: Sink operators keep statistics on latency markers received per parallel source instance, thus checking the latency marker at sinks can be used to approximate how long it takes for records to traverse the dataflow.
zh_cn: 数据汇算子会为每个数据源的并行实例分别保存延迟标记的统计信息，因此通过检查数据汇的延迟标记可以估计出记录流遍整个Dataflow所需的时间。

source: SinkFunction in Example 8-12 neither performs idempotent writes nor features
zh_cn: 而8-12中的SinkFunction二者都不具备。

source: Sinks acknowledge the reception of a checkpoint barrier to the JobManager and a checkpoint is complete when all tasks have acknowledged the successful check‐ pointing of their state
zh_cn: 数据汇任务向JobManager确认收到检查点分隔符，在所有任务成功将自身状态存入检查点后整个应用的检查点才算完成

source: Sliding windows assign events into overlapping buckets of fixed size.
zh_cn: 滑动窗口（sliding window）将事件分配到大小固定且相互重叠的桶中，

source: Sliding count-based window with a length of 4 events and a slide of 3 events.
zh_cn: 长度为4个事件滑动间隔为3个事件的基于数量的滑动窗口。

source: Sliding count-based window with a length of four events and a slide of three events
zh_cn: 长度为4个事件滑动间隔为3个事件的基于数量的滑动窗口

source: Sliding windows
zh_cn: 滑动窗口

source: So far we have discussed how to generate watermarks using a TimestampAssigner.
zh_cn: 目前为止，我们已经讨论过如何使用TimestampAssigner生成水位线，

source: So far we have explained how to start an application on a running Flink cluster.
zh_cn: 到目前为止，我们已经介绍过如何在一个运行的Flink集群上启动一个应用，

source: So far we have explained what timestamps and watermarks are and how they are internally handled by Flink.
zh_cn: 到目前为止，我们已经解释了时间戳和水位线的含义以及它们在Flink内部的处理逻辑，

source: So far, you have seen how stream processing addresses limitations of traditional batch processing and how it enables new applications and architectures.
zh_cn: 至此，你已经了解过流式应用如何突破传统批处理的局限以及它如何支持新的应用和架构。

source: So far, you have seen how stream processing addresses some of the limitations of tra‐ ditional batch processing and how it enables new applications and architectures.
zh_cn: 至此，你不但已经见过流式应用是如何突破传统批处理的一些局限以及它如何支持新的应用和架构，

source: So, can you get both low latency and high throughput or is this a hopeless endeavor?
zh_cn: 既然这样，可以通过某种方式同时获得低延迟和高吞吐吗？还是说这根本不切实际？

source: So, it is crucial to configure the transaction timeout property appropriately.
zh_cn: 所以说，有必要为它配置一个合适的值。

source: So, sinks that extend GenericWriteAheadSink cannot be added using DataStream.addSink() but are attached using the DataStream.transform() method.
zh_cn: 因此我们无法使用DataStream.addSink()方法添加一个继承自GenericWriteAheadSink的数据汇，而是要用到DataStream.transform()方法。

source: Some Linux distribution periodically clean the temporary direc‐ tory /tmp.
zh_cn: 部分Linux发行版会定期清理/tmp临时目录。

source: Some applications also leverage Flink’s domain-specific libraries, such as the Table API, SQL, or the CEP library.
zh_cn: 还有一些应用需要用到Flink一些特定领域的库（例如：Table API、SQL或CEP库）。

source: Some backends do not support all options and might ignore them.
zh_cn: 如果状态后端不支持某些选项，则可能会自动忽略它们。

source: Some checkpointing options are backend specific.
zh_cn: 部分检查点的选项是某些状态后端所特有的。

source: Some of the first research proto‐ types and commercial products date back to the late 1990s.
zh_cn: 一些最初的研究原型和商业产品甚至可以追溯到上世纪90年代。

source: Some of the transformations you saw in the previous section require a key specifica‐ tion or field reference on the input stream type.
zh_cn: 上一节中涉及的部分转换需要基于输入流的类型指定键值或引用字段。

source: Some sink systems provide a transaction ID that can be used to commit or abort an open transaction.
zh_cn: 部分数据汇系统可以提供用于提交或终止已开启事务的事务ID。

source: Some special types
zh_cn: 一些特殊类型

source: Some transformations can produce a new DataStream, pos‐ sibly of a different type, while other transformations do not modify the records of the
zh_cn: 有些会生成一个新的DataStream（类型可能不同）；而另外的一些不会修改DataStream中的记录，仅会通过分区或分组的方式将其重新组织。

source: Sometimes it is necessary or desirable to control the partitioning strategies at the application level or define custom partitioners.
zh_cn: 某些时候，我们有必要或希望能够在应用级别控制这些分区策略，或者自定义分区器。

source: Sometimes the input stream contains special tuples or markers that indicate the stream’s progress.
zh_cn: 有时候输入流中会包含一些用于指示系统进度的特殊元组或标记。

source: Sometimes, though, the necessary information cannot be extracted (e.g., because of Java erasing generic type information).
zh_cn: 但有时候一些必要的信息可能无法提取（例如：由于Java会擦除泛型信息）。

source: Source Functions, Timestamps, and Watermarks
zh_cn: 数据源函数、时间戳及水位线

source: Source functions are discussed in more detail in “Implementing a Custom Source Function” on page 202.
zh_cn: 我们会在第202页"实现自定义数据源函数"一节详细讨论数据源函数。

source: SourceContext provides the following methods:
zh_cn: 它的类提供了以下方法：

source: SourceFunction and ParallelSourceFunction define two methods:
zh_cn: SourceFunction和ParallelSourceFunction中定义了两个方法：

source: SourceFunction and RichSourceFunction can be used to define nonparallel source connectors—sources that run with a single task.
zh_cn: SourceFunction和RichSourceFunction可用于定义非并行的数据源连接器，只能在单任务下运行。

source: SourceFunction that counts to Long.MaxValue
zh_cn: 从0数到Long.MaxValue的SourceFunction

source: Sources checkpoint their state and emit a checkpoint barrier
zh_cn: 数据源为状态生成检查点并发出检查点分隔符

source: Special thanks go to our fellow Flink committers: Alan Gates, Aljoscha Krettek, Andra Lungu, ChengXiang Li, Chesnay Schepler, Chiwan Park, Daniel Warneke, Dawid Wysakowicz, Gary Yao, Greg Hogan, Gyula Fóra, Henry Saputra, Jamie Grier, Jark Wu, Jincheng Sun, Konstantinos Kloudas, Kostas Tzoumas, Kurt Young, Márton Balassi, Matthias J. Sax, Maximilian Michels, Nico Kruber, Paris Carbone, Robert
zh_cn: 特别感谢Flink社区的Committer们：Alan Gates、Aljoscha Krettek、Andra Lungu、ChengXiang Li（李呈祥）、Chesnay Schepler、Chiwan Park、 Daniel Warneke、Dawid Wysakowicz、Gary Yao、Greg Hogan、Gyula Fóra、Henry Saputra、Jamie Grier、Jark Wu（伍翀）、Jincheng Sun（孙金城）、 Konstantinos Kloudas、Kostas Tzoumas、Kurt Young（杨克特）、Márton Balassi、Matthias J. Sax、Maximilian Michels、Nico Kruber、Paris Carbone、Robert

source: Specific reading positions for all partitions as provided by a Map object:
zh_cn: 利用一个Map对象为所有分区指定读取位置：

source: Specifically, we explain how to define and interact with different types of state in user-defined func‐ tions.
zh_cn: 具体而言，我们将解释如何在用户自定义函数中定义不同类型的状态并与之交互。

source: Specifying Unique Operator Identifiers
zh_cn: 指定算子唯一标识

source: Split a tuple stream into a stream with large numbers and a stream with small numbers.
zh_cn: 将元组流拆分成一条大数字流和一条小数字流。

source: Split and select
zh_cn: Split和Select

source: Split is the inverse transformation to the union transformation.
zh_cn: split转换是union转换的逆操作。

source: Split operator list state for better distribution during rescaling
zh_cn: 将算子列表状态拆分，从而在扩缩容时实现更佳的分布

source: Stand-Alone Cluster
zh_cn: 独立集群

source: Standalone Cluster
zh_cn: 独立集群

source: Start a local Flink cluster.
zh_cn: 启动本地Flink集群。

source: Start a local Flink cluster:
zh_cn: 启动本地Flink集群：

source: Start a new task chain with an operator
zh_cn: 为算子开启一个新的链接

source: Starting a Flink cluster on YARN in job mode
zh_cn: 以作业模式启动Flink YARN集群

source: Starting a Flink cluster on YARN in session mode
zh_cn: 以会话模式启动Flink YARN集群

source: Starting a master and a worker container in Docker
zh_cn: 在Docker中启动一个主容器和一个工作容器

source: Starting a standalone Flink cluster
zh_cn: 启动一个Flink独立集群

source: Starting an application
zh_cn: 启动应用

source: Starting an application from a savepoint
zh_cn: 从保存点启动应用

source: Starting an application from a savepoint allows you to do much more.
zh_cn: 而将应用从某个保存点启动还能让你做更多事情。

source: Starting an application from a savepoint is fairly simple.
zh_cn: 从保存点启动应用非常简单。

source: Starting from the base directory, the templates are located in:
zh_cn: 从根目录算起，模板位于：

source: Starting from the base folder of the distribution, the script is located at ./ flink-container/docker/build.sh.
zh_cn: 脚本位于发行版根目录中./flink-container/docker/build.sh。

source: Starts the application defined by the JAR file (and entry-class) with the provided parameters.
zh_cn: 使用指定参数启动JAR文件（以及入口类）所指定的应用。

source: State Backends
zh_cn: 状态后端

source: State Management
zh_cn: 状态管理

source: State Management | 53
zh_cn: 状态管理 | 53

source: State and Consistency Models
zh_cn: 状态和一致性模型

source: State and Consistency Models | 33
zh_cn: 状态和一致性模型 | 33

source: State and consistency models
zh_cn: 状态和一致性模型

source: State backends differ in how state is checkpointed.
zh_cn: 不同的状态后端生成状态检查点的方式也存在一定差异。

source: State checkpointing is important because Flink is a distributed system and state is only locally maintained.
zh_cn: 由于Flink是一个分布式系统但只在本地维护状态，所以状态检查点就显得极其重要。

source: State evolution and migration is an important topic in the Flink community and receives a lot of attention.
zh_cn: 状态的演变和迁移在Flink社区是一个非常重要的主题，也得到了很多关注。
